import '../styles/main.scss';
import $ from 'jquery';
import 'jquery.scrollbar';
import 'validate.js/validate.min';
import validate from "validate.js";

$(window).on('load', function () {

  $('.scrollbar-inner').scrollbar();

  function checkSmallScreens() {
    if ($(window).width() < 1280) {
      $('section').addClass('animate');
    }
  }

  checkSmallScreens();

  $(window).on('resize', function () {
    checkSmallScreens();
  })


  const constraints = {
    name: {
      presence: { allowEmpty: false }
    },
    phone: {
      presence: { allowEmpty: false }
    }
  };

  $('.form').on('submit', function (e) {
    e.preventDefault();

    let $form = $(this);

    $form.find('.error-message').remove();
    $form.find('input').removeClass('invalid');

    const formValues = {
      name: $form.find('input[name="name"]').val(),
      phone: $form.find('input[name="phone"]').val()
    };

    let errors = validate(formValues, constraints);

    if (!errors){
      let $this = $(this);

      $.ajax({
        type: "POST",
        url: "send-form.php",
        // dataType: "json",	// Тип данных, в которых сервер должен прислать ответ
        data: $this.serialize() + '&type=' + $this.attr('id'),
        error: function () {
          console.log('При выполнении запроса произошла ошибка');
        },
        success: function () {
          console.log('Отправлено!');

          $('body').append(`
          <div class="form-sent-popup">
            <svg width="119" height="116" viewBox="0 0 119 116" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M118.959 39.87C118.828 39.2709 118.39 38.7851 117.808 38.591L77.9802 25.3151C77.0672 25.0111 76.0797 25.5043 75.7752 26.4175C75.4707 27.3309 75.9644 28.3182 76.8778 28.6225L110.147 39.712L67.626 47.1069L12.0211 7.00356L69.4329 26.1409C70.3461 26.4447 71.3334 25.9519 71.6379 25.0385C71.9423 24.1251 71.4487 23.1378 70.5353 22.8336L2.29447 0.0864681C2.27122 0.0787982 2.25472 0.0771714 2.23473 0.0720581C1.74014 -0.0734377 1.19186 -0.000922331 0.745843 0.310755C0.0608969 0.788613 -0.188724 1.68506 0.150379 2.4481L46.3558 106.41C46.5856 106.928 47.0526 107.301 47.6078 107.412C47.7212 107.434 47.8354 107.446 47.9485 107.446C48.3906 107.446 48.8213 107.277 49.1483 106.967L68.4286 88.6792L85.5222 99.4752C85.5302 99.4803 85.539 99.4815 85.5471 99.485C85.8156 99.6488 86.1258 99.7446 86.4519 99.7446C86.5172 99.7446 86.5828 99.7409 86.649 99.7334C87.4527 99.6425 88.0884 99.0106 88.1839 98.2073L91.9596 66.4474L118.451 41.5142C118.898 41.0937 119.091 40.4692 118.959 39.87ZM111.831 42.9575L90.1567 63.3567L71.5788 49.9578L111.831 42.9575ZM76.2347 76.4699L51.0246 100.382L60.4784 61.177L76.2347 76.4699ZM78.012 79.589L83.1076 93.8267L71.0382 86.2037L78.012 79.589ZM85.5971 90.4363L80.3934 75.8968C80.3899 75.887 80.3846 75.8782 80.3809 75.8684C80.2911 75.6313 80.1519 75.4133 79.9662 75.2332L54.1695 50.1954C53.479 49.5251 52.3752 49.5416 51.7047 50.2321C51.0342 50.9231 51.0507 52.0266 51.7414 52.6969L57.5724 58.3564L47.4572 100.304L6.99682 9.26828L46.7358 47.8384C47.4263 48.5089 48.5301 48.4926 49.2006 47.8017C49.8711 47.1107 49.8546 46.0071 49.1639 45.3368L20.104 17.1318L88.4515 66.4258L85.5971 90.4363Z" fill="white"/>
              <path d="M113.406 88.1934C112.96 88.1934 112.514 88.0233 112.173 87.683L96.7716 72.2811C96.0908 71.6001 96.0908 70.4966 96.7716 69.8158C97.4523 69.1353 98.5561 69.1353 99.2366 69.8158L114.639 85.2177C115.319 85.8987 115.319 87.0022 114.639 87.683C114.298 88.0233 113.852 88.1934 113.406 88.1934Z" fill="white"/>
              <path d="M86.4536 115.147C86.0076 115.147 85.5613 114.977 85.221 114.636L69.8191 99.2345C69.1384 98.5535 69.1384 97.45 69.8191 96.7692C70.4999 96.0887 71.6037 96.0887 72.2842 96.7692L87.6861 112.171C88.3669 112.852 88.3669 113.956 87.6861 114.636C87.3456 114.976 86.8996 115.147 86.4536 115.147Z" fill="white"/>
              <path d="M113.406 115.147C112.96 115.147 112.514 114.977 112.173 114.636L96.7716 99.2345C96.0908 98.5535 96.0908 97.45 96.7716 96.7692C97.4523 96.0887 98.5561 96.0887 99.2366 96.7692L114.639 112.171C115.319 112.852 115.319 113.956 114.639 114.636C114.298 114.976 113.852 115.147 113.406 115.147Z" fill="white"/>
            </svg>
            <p>Заявка отправлена</p>
            <a href="#">Хорошо!</a>
          </div>
          `);

          $('.form-sent-popup a').on('click', function (e) {
            e.preventDefault();
            $('.form-sent-popup').hide();
          })
        }
      });
    } else {

      for (const [key, value] of Object.entries(errors)) {
        $($form.find(`input[name="${key}"]`)).addClass('invalid');
        $($form.find(`input[name="${key}"]`)).after('<p class="error-message">Поле не может быть пустым</p>');
      }

      console.log(errors);
      return false;
    }
  });

});

